//----------------------------------------------------------------------------

//Project:  Capstan motor controller
//Compiler: IAR EWARM 6.12
//Target:   ATmega88PA
//Fuses:    F9 D5FF
//E-mail:   wubblick@yahoo.com

//------------------------ Структура программы: ------------------------------

//               [Main]
//                  |
//        |--------------------|
//    [Control]              [Port]
//        |                    |
//    |-------|           |---------|
// [Dpll]  [Eeprom]  [Wakeport] [Commands]
//    |       |           |
//  [Pwm]  [Eemap]      [Wake]

//----------------------------------------------------------------------------

#include "main.hpp"
#include "control.hpp"
#include "port.hpp"

//----------------------------- Переменные: ----------------------------------

TControl *Control;
TPort *Port;

//----------------------------------------------------------------------------
//------------------------- Основная программа: ------------------------------
//----------------------------------------------------------------------------

int main(void)
{
  TSysTimer::Init();        //инициализация системного таймера
  Control = new TControl(); //создание объекта управления
  Port = new TPort();       //создание объекта порта

  do                        //основной цикл
  {
    TSysTimer::Sync();      //синхронизация системных тиков с основным циклом
    Control->Execute();     //выполнение задачи управления
    Port->Execute();        //выполнение команд компьютера
  }
  while(1);
}

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
